{
  "intents": [
    {
      "tag": "corte",
      "patterns": [
        "¿Qué hago si me corto el dedo?",
        "¿Cómo detengo el sangrado de una cortadura?",
        "¿Cuándo debo ir al médico por un corte?",
        "Qué hago si me corto el dedo por favor",
        "Me hice una cortada, ¿qué hago?",
        "¿Es peligroso cortarse con metal?",
        "¿Cómo limpiar un corte profundo?",
        "¿Puedo usar alcohol en una cortadura?",
        "¿Cuánto tiempo tarda en cerrar un corte?",
        "¿Debo poner una venda en una herida?",
        "Sangra mucho, ¿qué hago?",
        "Me corté con vidrio, ¿qué hago?",
        "¿Qué pasa si la herida se infecta?",
        "¿Cómo saber si debo ir a urgencias por un corte?"
      ],
      "responses": [
        "Lava la herida con agua y jabón. Aplica presión para detener el sangrado y cúbrela con una gasa limpia.",
        "Si el sangrado no se detiene en 10 minutos, busca atención médica.",
        "Evita tocar la herida directamente sin guantes limpios.",
        "Si el corte es profundo o no deja de sangrar, consulta a un médico.",
        "Aplica un antiséptico si lo tienes y mantén la herida limpia y protegida.",
        "No retires objetos incrustados. Cubre la zona y acude a urgencias.",
        "Si hay signos de infección como enrojecimiento, calor o pus, busca atención médica."
      ]
    },
    {
      "tag": "quemadura",
      "patterns": [
        "¿Qué hacer ante una quemadura leve?",
        "¿Debo aplicar hielo a una quemadura?",
        "¿Qué crema se usa para quemaduras?",
        "Qué hacer ante una quemadura leve por favor",
        "Qué hacer si alguien se quema con aceite",
        "Me quemé cocinando, ¿qué hago?",
        "¿Las ampollas de quemadura se revientan?",
        "¿Qué pasa si me quemo con agua hirviendo?",
        "¿Qué tipo de vendaje se usa para quemaduras?",
        "¿Cómo tratar una quemadura en casa?",
        "¿Debo cubrir una quemadura con plástico?",
        "¿Cuánto tiempo aplicar agua en una quemadura?",
        "¿Qué no debo hacer con una quemadura?",
        "¿Puedo usar mantequilla en quemaduras?"
      ],
      "responses": [
        "Enfría la zona con agua corriente por al menos 10 minutos. No apliques hielo directamente.",
        "No revientes las ampollas y cubre la quemadura con una gasa limpia y seca.",
        "Consulta a un médico si la quemadura cubre una gran zona o está en cara, manos o genitales.",
        "No uses remedios caseros como mantequilla o pasta dental.",
        "Si la ropa está pegada a la piel, no la retires. Busca atención médica.",
        "Usa gasas no adhesivas y cambia el vendaje diariamente con cuidado.",
        "Evita exponer la quemadura al sol durante la recuperación."
      ]
    },
    {
      "tag": "desmayo",
      "patterns": [
        "¿Qué hacer si alguien se desmaya?",
        "¿Se debe dar agua a alguien que se desmaya?",
        "¿Cuándo preocuparse por un desmayo?",
        "Qué hacer si alguien se desmaya por favor",
        "Mi amigo se desmayó, ¿cómo lo ayudo?",
        "¿Por qué alguien se puede desmayar?",
        "¿Qué no se debe hacer ante un desmayo?",
        "¿Hay que poner a alguien desmayado de lado?",
        "¿Qué hacer si una persona se desmaya y no responde?",
        "¿Cuánto tiempo debe durar un desmayo?",
        "¿Es normal vomitar tras un desmayo?",
        "¿Qué hacer después que alguien recupere la conciencia?",
        "¿Qué hago si el desmayo fue por calor?"
      ],
      "responses": [
        "Acuesta a la persona y eleva sus piernas. Afloja su ropa y asegúrate de que respire.",
        "No le des agua si está inconsciente. Llama a emergencias si no responde en 1 minuto.",
        "Observa si hay signos de convulsiones o lesiones.",
        "Después de que despierte, mantén a la persona sentada y tranquila.",
        "No intentes incorporarla a la fuerza ni le pongas nada en la boca.",
        "Si no recupera la conciencia en 1 minuto, inicia maniobras de RCP si estás capacitado.",
        "Evita aglomeraciones alrededor de la persona, permite que respire aire fresco."
      ]
    },
    {
      "tag": "fractura",
      "patterns": [
        "¿Qué hacer si sospecho una fractura?",
        "¿Cómo saber si hay una fractura?",
        "¿Debo tratar de alinear el hueso roto?",
        "Qué hacer si sospecho una fractura por favor",
        "Me duele al moverlo, ¿será fractura?",
        "Se escucha un crujido, ¿es fractura?",
        "¿Puedo mover una extremidad con fractura?",
        "¿Qué hacer si hay deformidad en el brazo?",
        "¿Debo usar una férula casera?",
        "¿Qué es una fractura abierta?",
        "¿Qué riesgos tiene una fractura no tratada?",
        "¿Se puede hinchar una fractura?",
        "¿Cuándo acudir a urgencias por un golpe fuerte?"
      ],
      "responses": [
        "Inmoviliza la zona afectada y evita mover a la persona. No intentes alinear el hueso.",
        "Aplica una férula improvisada si sabes cómo, y busca atención médica de inmediato.",
        "Si hay sangrado, cúbrelo con una gasa antes de inmovilizar.",
        "No apliques presión directa sobre un hueso roto.",
        "Eleva la zona afectada y evita moverla en exceso.",
        "Si ves el hueso expuesto o hay mucha deformidad, no intentes moverlo.",
        "Una hinchazón rápida o incapacidad de mover puede ser señal de fractura."
      ]
    },
    {
      "tag": "emergencia_general",
      "patterns": [
        "¿Qué hacer en una emergencia médica?",
        "¿Cuál es el número de emergencias?",
        "Qué hacer en una emergencia médica por favor",
        "¿A quién llamo en caso de accidente?",
        "¿Cómo actuar ante una situación de emergencia?",
        "¿Debo mover a una persona herida?",
        "¿Cómo evalúo a una persona inconsciente?",
        "¿Qué hacer si hay fuego o peligro en el lugar?",
        "¿Cómo saber si debo aplicar RCP?",
        "¿Qué hacer antes de que lleguen los paramédicos?",
        "¿Cómo tranquilizar a alguien en shock?",
        "¿Qué pasos seguir ante una emergencia grave?",
        "¿Es seguro tocar a una persona electrocutada?"
      ],
      "responses": [
        "Llama al número local de emergencias. Mantén la calma y proporciona la información necesaria.",
        "Evalúa si la persona respira y responde. Aplica RCP si es necesario y estás capacitado.",
        "Protege el entorno, no te pongas en peligro.",
        "No muevas a la persona a menos que haya riesgo de más daño.",
        "Guía a los servicios de emergencia hacia el lugar del incidente.",
        "Intenta mantener a la persona consciente y tranquila.",
        "Si hay más personas, delega tareas claras mientras esperas ayuda."
      ]
    }
  ]
}
